const data = [
  
  ["C\u2086H\u2085- радикал атауы ", "фенил"],
  ["C\u2086H\u2085CH\u2082 радикал атауы", "бензил"],
  ["Галогеналкандар бензолмен өршіткі қатысында (AlCl\u2083) әрекеттесіп, бензолдың гомологтарынтүзеді \
  Бұл реакция ... реакциясы деп аталады", "Фридель-Крафтс"],
  ["Бензол мен осы заттың көп мөлшері басты айналдырып, жүректі айнытады, ал кейбір ауыр жағдайларда уланудың арты өлімге душар етеді. \
  Бензол мен осы зат буы адам терісі арқылы организмге сіңеді. Олармен ұзақ уақыт улану лейкемия және анемия ауруларының \
   пайда болуына әкеледі. Бұл қай зат", "толуол"],
  ["2,4,6-тринитротолуол(ТНТ)қопару жұмыстарында қолданылатын (туннель, шахта, метро және т.б. салуда) \
   күшті жарылғыш зат. Бұл заттың басқа атауы", "тротил"],
  ["Өндірісте формальдегидтің негізгі бөлігін осы заттан алады. Оның буын ауамен бірге мыстан немесе \
  күмістен жасалған қыздырылған тор арқылы өткізеді. Бұл зат атауы", "метанол"],
  ["Магний-органикалыққосылыс:R—Mg—X басқа атауы ... реактиві. Оны қолданып альдегидтермен кетондардан спирттер алуға болады", "Гриньяр"],
  ["Бұл зат фенолформальдегид шайырын, бояулар, синтетикалық көксағыз және қопарғыш заттар алуда қолданылады. \
  Оның сулы ерітіндісі формалин органикалық заттарды, \
  ағзалармен организмдерді бальзамдауға, анатомиялық препараттарды консервілеуге, тері илеуге және \
  залалсыздандырғыш зат ретінде қолданылады. Ф.... ", "формальдегид"],
  ["Құрамында 7-ден ?-ға дейін көміртек атомдары болатын жоғарыа альдегидтер хоши істі болғандықтанп арфюмерияда кеңінен \
  қолданылады. Санды жазыңыз", "16"],
  ["? және басқа кетондар лак, бояу және синтетикалық шайырларға жақсы еріткіш болып табылады.", "ацетон"],
  ["? қышқылы глицерин эфирі түрінде сиыр сүтінде, сарымайда болады. Көмірсулардың ашу процесі нәтижесінде түзіледі. \
  Тамақ өнімдерінде ашытылған қырыққабатта, ірімшікте болады, аздаған мөлшерде", "май"],
  ["? қышқылы валериан өсімдігінің тамырынан табылған", "валериан"],
  ["? қышқылы (лавр) алғаш рет лавр майында табылды. Ол кокос және пальма майларында бар", "лаурин"],
  ["? қышқылы көптеген жануар және өсімдік майлары глицеридтерінің құрамына кіреді, \
  мысалы: пекуя жемістері мен сүйектерінен жасалған май, пальма майы, қара кофе майы, баобабмайы т.б.", "пальмитин"],
  ["? қышқылы қой майы, сарымай, зәйтүн, күнбағыс және жержаңғақ майларында кездеседі.", "маргарин"],  
  ["Төменгі карбон қышқылдары өздеріне тән өткір иісі бар, суда жақсы еритін сұйық заттар. \
  Құрамында 4-тен нешеге дейінгі көміртек атомдары болатын карбон қышқылдары жағымсыз иісті май тәріздес сұйықтықтар болады? Санды жазыңыз", "9"],
  ["Молекуласында көміртек атомдарының саны нешеден(сан) артық болатын карбон қышқылдары суда ерімейтін қатты заттар. Салыстырмалы молекулалық \
  массалары өскен сайын карбон қышқылдарының судағы ерігіштігі кеміп, қайнау температурасы өседі.", "9"],
  ["Құмырсқа қышқылының тұздары ?,сірке қышқылының тұздары ацетаттар, пропион қышқылының тұздары пропионаттар деп аталады.", "формиаттар"],
  ["? қышқылын пластмасса және жасанды талшық алуда қолданады. Әр түрлі металдардың ацетаттарын маталарды бояуға пайдаланады. \
  Сонымен қатар сірке қышқылы тамақ өнеркәсібімен тұрмыста кең қолданылады.", "сірке"],
  ["? қышқылының залалсыздандырғыш қасиеті бар. Сондықтан тамақ өнеркәсібінде, тері мен фармацевтика өндірісінде, медицинада \
  және маталар мен қағаз бояуда қолданылады", "құмырсқа"],
  ["Күрделі эфирлердің гидролизденуі ? реакциясы деп аталады.", "сабындану"],
  ["CH\u2083NH\u2082 дәрілік препараттар мен бояғыш заттар синтезіне қажет шикізат болып табылады. Зат атауы", "метиламин"],
  ["(СH\u2083)\u2082NH көксағызды вулканизациялауға және әртүрлі дәрілік препараттарды синтездеуде қолданылады. Зат атауы", "диметиламин"],
  ["Осы зат химия өнеркәсібінің маңызды өнімдерінің бірі. Ол көптеген анилинді бояуларды алатын шикізат болып табылады. \
  Анилинді маңызды дәрілік заттар, мысалы, сульфаниламид препараттарын, формальдегидшайырларын және кейбір қопарғыш заттарды алуда \
  қолданады.", "анилин"],
  ["Қаныққан қарапайым аминдер (C\u2081—C\u2083) — ? иісті газ тәрізді заттар. Қарапайым аминдер суда жақсы ериді, көмірсутек радикалы өскенсайын аминдердің ерігіштігі төмендейді.", "аммиак"],
  ["ал гомологты ққатардың ортаңғы мүшелері (C\u2084—C\u2089) шіріген ? иістес, жағымсыз өткір иісті сұйықтықтар.", "балық"],
  ["Жоғары аминдер иіссіз,түссіз заттар. Олардың агрегаттық күйі", "қатты"],
  [" ? - суда ерімейтін, майтәріздес, түссіз улы сұйықтық. Ол спиртпен бензолда жақсы ериді. Ауада тез тотығып қоңырланады. (амин)", "анилин"],
  ["? маңызды қоректік зат. Организмге оңай сіңірілетін және оған күш беретін зат ретінде емдік мақсатта пайдаланылады. \
  ? кондитерлік өндірісте карамель, мармелад жасауда кең қолданылады. Тотықсыздандырғыш ретінде айна және шырша ойыншық тарын жасауда \
  қолданылады. ? ашытып сүт қышқылын және басқа өнімдерді алады.", "глюкоза"],
  ["Егер сахароза ерітіндісін мыс(II) гидроксидіне қосса, мыс(II) сахаратының ? түсті ерітіндісі түзіледі. Бірақ \
  сахароза күміс-айна реакциясына түспейді. Олай болса, сахарозаның глюкозадан айырмашылығы ол альдегид емес, бірақ оның \
  молекуласында гидроксил топтары бар. (түсті жазу керек)", "ашық көк"],
  ["? аққайыңның, үйеңкінің, қауынның шырындарында болады. Әсіресе ол қант қызылшасымен қант қамысында көп кездеседі", "сахароза"],
  ["? (сүт қанты) α-глюкоза мен α-галактозаның қалдықтарынан құралған.", "лактоза"],
  ["? (солод қанты) α-глюкозаның екі қалдығынан тұрады.", "мальтоза"],
  ["A заты — суда ерімейтін ақ ұнтақ. Ыстық суда ісініп, коллоидті ерітінді—клейстер түзеді. \
  А затының өзіне тән қасиеті— оның йодпен әрекеттесуі. ? суыған клейстеріне йод ерітіндісін тамызса, көк түс пайда болады. \
  Мұндай түстің түзілуін йод ерітіндісін картоп кесіндісіне немесе ақ нанға тамызғанда да байқауға болады. \
  Тамақ өнімдеріндегі А затын осылай анықтайды. А затының буын саны бірнеше жүзден бірнеше мыңға дейін жетеді. А заты атауы", "крахмал"],
  ["В заты табиғи полимер. В затының молекуласының құрылысы тек сызықтық. В затының мақта, \
  кендір сияқты талшықты материал түзуі оның осы құрылысымен түсіндіріледі. А затының буын санының көптігімен ерекшеленеді, \
  молекулалық массасы бірнеше миллионға жетеді. В затының формуласы (C\u2086H\u2081\u2080O\u2085)n", "целлюлоза"],
  ["А заты немесе клетчатка өсімдіктер құрамына жасуша қабығын түзетін зат ретінде кіреді. Осыдан оның атауы шыққан. \
  Ол өсімдіктерге қажетті беріктікпен иілгіштік береді. Мақта талшығында 98%-ға дейін А заты болады. Кендір мен кенепшөп, негізінен, осы заттан құралады. \
  Ағаш сүрегінің 50%-ы осы заттан тұрады, Суда, органикалық еріткіштерде ерімейтін талшықты зат.", "целлюлоза"],
  ["Күнделікті тұрмысымыздан целлюлозаның жақсы жанатынын білеміз. Ағашты ауасыз қыздырғанда целлюлоза ыдырайды. Нәтижесінде ағаш көмірі, метан, және осы \
  спирт түзіледі. Спирт атауын жазыңыз", "метанол"],
  ["Целлюлоза нитраттарының ортақ қасиеті олардың жанғыштығы. Целлюлозаның тринитраты — ? деп аталатын күшті қопарылғыш зат. Ол түтінсіз оқ-дәрі жасауда қолданылады.", "пироксилин"],
  ["Целлюлоза эфирлерінің маңызы зор. Мысалы, целлюлоза ...ынан жанбайтын қабыршақ(пленка) және органикалық шыны алынады.", "ацетат"],
  ["Судағы ерігіштігіне қарай нәруыздар глобулалы және ? болып бөлінеді. Глобулалы нәруыздар суда, сондай-ақ қышқылдар мен сілтілердің сулы ерітінділерінде ериді (мысалы, \
    тауық жұмыртқасындағы альбумин). ? нәруыздар суда ерімейді, мысалы, оған жүннің, шаштың құрамында болатын кератин жатады.", "талшықты"],
  ["Нешінше реттік құрылымда нәруыз молекуласындағы аминқышқылдарының қалдықтары ретті полипептидтік тізбек түзе байланысады. Сөзбен жазыңыз", "бірінші"],
  ["Құрамы тек аминқышқылдарынан тұратын нәруыздар ? деп аталады.", "протеиндер"],
  ["Құрамына амин қышқылдарымен қатар полисахаридтердің, ортофосфор қышқылының қалдықтары, металл катиондары және т.б. кіретін нәруыздар ? деп аталады.", "протеидтер"],
  ["Амин тобындағы сутек атомдарымен карбоксил тобындағы оттек атомдары арасында молекулаішілік сутектік байланыстың түзілуінен көп нәруыздардың полипептидтік тізбектері \
  оратылып, оралма тәрізді ? реттік құрылым түзеді.", "екінші"],
  ["Нәруыздың ? реттік құрылымы полипептидтік тізбектің кеңістіктегі оралма тәрізді пішіні. Аминқышқылдарының күкірті бар тізбектерінде —S—S— дисульфидтік байланыстың \
  түзілуі карбоксил және гидроксил топтары, сондай-ақ карбонил және амин топтары арасындағы күрделі эфирлік байланыстар (-COO-) ?-лік құрылымға беріктік береді. \
  Нәтижесінде полипептидтік оралма түйінге айналады. Нәруыз молекуласының өзіне тән биологиялық белсенділігі осы ?-лік құрылымға байланысты.", "үшінші"],
  ["Ауыр металдардың (Hg2+, Pb2+, Cu2+ және т.б.) тұздары, концентрлі қышқылдар мен сілтілер, сондай-ақ қыздыру, ультра күлгін сәулелермен γ-сәулелер әсерінен нәруыздардың бірінші реттік \
  құрылымы сақталып, ал екінші, үшінші, төртінші реттік құрылымдары бұзылады. Бұл құбылыс нәруыз ? деп аталады.", "денатурациясы"],
  ["? немесе энзимдер деп тірі организмдердің тіршілігін қамтамасыз ететін реакцияларды жылдамдататын нәруыздардан түзілген органикалық өршіткілерді айтады. Химиялық тұрғыдан \
  ? тірі жасушаларда түзілетін нәруыз молекулалары.", "ферменттер"],
  ["Күрделі фермент құрамындағы нәруызға жатпайтын құрамбөлігін В тобының дәрумендері, С дәруменімен көптеген микроэлементтер құрайды. \
  Нәруыздың осындай кіші молекулалы құрамбөлігі ? деп аталады. ?-дің ферменттерден ерекшелігі олар организмде синтезделмейді, оған тағаммен бірге түседі", "коферменттер"],
  ["Әр фермент бір ғана реакцияны немесе бір типті реакцияларды жылдамдатады. Олардың бұл ерекшелігі талдағыштық әсері депа талады. Талдағыштық әсері деп жазыңыз", "талдағыштық әсері"],
  ["Полиэтилен мен осы полимерден құбырлар, қабыршақ, пенопластар, халық кең қолданатын бұйымдар жасайды. Бұл полимерлерден жасалған бұйымдар механикалық жолмен жақсы өңделеді. \
  Полимер атауы", "полипропилен"],
  ["Осы полимерден электроқшаулағыш материалдар,ә ртүрлі тұрмысқа қажетті пластмасса бұйымдары, бет қаптайтын тақташалар жасалады. Полимер атауы", "полистирол"],
  ["Осы полимер — құрылыста ең көп қолданылатын полимерлердің бірі. Осы полмерден линолеум, қабыршақ, құбыр, бет қаптайтын материалдар жасайды. \
  Соңғы жылдары осы полимерді шатырларды жабуға, есіктердің блоктарын жасауға жиі қолданып жүр. Полимер атауы", "поливинилхлорид"],
  ["Бұл полимерді үйлерді, жылыжайларды, жүзу бассейндерін әйнектеуге қолданылады. Полтмер атауы", "полиметилметакрилат"],
  ["Тефлоннан құбырлар, мойынтіректер(подшипниктер), химиялық аппаратура бөлшектерімен тұрмыстық заттар жасалады. Тефлон деп жазыңыз", "тефлон"],
  ["? пластмассалары ең көп өндірілетін материалдар. ? полимеріне әртүрлі толықтырғыштар қоса отырып, фенопластар деп аталатын материалдар алуға болады. \
  Толықтырғыш ретінде талшықты материалдар, мысалы, қысқа талшықты мақтаны қосаотырып, беріктігі жоғары 'волокнит' деп аталатын пластмассал аралады. \
  Толықтырғыш ретінде мақта маталарды қолданып ерекше берік пластмасса 'текстолит' алынады.", "фенолформальдегид"],

  // ["", ""],
  // ["", ""],
  // ["", ""],
  // ["", ""],
  // ["", ""],
  // ["", ""],
  // ["", ""],
  

  

]

function shuffleArray(array) {
  for (let i = array.length - 1; i > 0; i--) {
    const j = Math.floor(Math.random() * (i + 1));
    [array[i], array[j]] = [array[j], array[i]];
  }
  return array;
}


const question = document.querySelector('.question');
const answerId = document.getElementById('answer');
const points = document.querySelector('.points');
const rightAnswers = document.querySelector('.rightAnswer');
const nextBtn = document.querySelector('.nextBtn')
const submitBtn = document.querySelector('.submitBtn');
const revealAnswerBtn = document.querySelector('.giveUpBtn');
const answer = document.getElementById('answer');
const result = document.querySelector('.result');
const giveUpBtn = document.querySelector('.giveUpBtn');


function emptifyElement(a) {
  a.innerHTML = "";
}

function App() {
  let i = 0;
  let newArr = shuffleArray(data);
  let pickedQuestion = undefined;
  let answered = true;
  let pointsValue = 0;

  nextBtn.addEventListener('click', (e) => {
    e.preventDefault();
    if (answered == true) {
    result.classList.remove('lightcoral');
    result.classList.remove('lightgreen');
    question.classList.remove('lightcoral');
    question.classList.remove('lightgreen');
      emptifyElement(question);    
    if (i == newArr.length){
      newArr = shuffleArray(data);
      i=0;
    } 
    pickedQuestion = newArr[i];
    i++;
    if  (pickedQuestion[0][0] == '.') {
      const photo = document.createElement('img');
      photo.setAttribute('src', `${pickedQuestion[0]}`);
      question.appendChild(photo);
    }
    else {
    const questText = document.createElement('h4');
    questText.innerHTML = pickedQuestion[0];
    question.appendChild(questText);
    }
    answered = false;
    answer.value = "";
  }
  })

  submitBtn.addEventListener('click', () => {
    if (answer.value.toLowerCase() == pickedQuestion[1].toLowerCase()){
      question.classList.remove('lightcoral');
      question.classList.add('lightgreen');
      result.classList.remove('lightcoral');
      result.classList.add('lightgreen');
      if (answered == false ) {
        pointsValue++;
        points.innerHTML = pointsValue;
      }
      answered = true;
      
    } else {
      question.classList.remove('lightgreen');
      question.classList.add('lightcoral');
      result.classList.remove('lightgreen');
      result.classList.add('lightcoral');
      pointsValue--;
      points.innerHTML = pointsValue;
    }
  })

  giveUpBtn.addEventListener('click', () => {
    
    if (answered == false) {
      answer.value = pickedQuestion[1];
      pointsValue--;
      points.innerHTML = pointsValue;
    
    }
    answered = true;
    
  })


}

App();